yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8tl53g4.h
/* ProxSense receiver control register 3 high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RXCR3_8     : 1;
  unsigned char RXCR3_9     : 1;
} __BITS_PXS_RXCR3H;
#endif
__IO_REG8_BIT(PXS_RXCR3H,  0x530E, __READ_WRITE, __BITS_PXS_RXCR3H);

/* ProxSense receiver control register 3 low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RXCR3_0     : 1;
  unsigned char RXCR3_1     : 1;
  unsigned char RXCR3_2     : 1;
  unsigned char RXCR3_3     : 1;
  unsigned char RXCR3_4     : 1;
  unsigned char RXCR3_5     : 1;
  unsigned char RXCR3_6     : 1;
  unsigned char RXCR3_7     : 1;
} __BITS_PXS_RXCR3L;
#endif
__IO_REG8_BIT(PXS_RXCR3L,  0x530F, __READ_WRITE, __BITS_PXS_RXCR3L);

/* ProxSense receiver inactive state register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RXINS8      : 1;
  unsigned char RXINS9      : 1;
} __BITS_PXS_RXINSRH;
#endif
__IO_REG8_BIT(PXS_RXINSRH, 0x5312, __READ_WRITE, __BITS_PXS_RXINSRH);

/* ProxSense receiver inactive state register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RXINS0      : 1;
  unsigned char RXINS1      : 1;
  unsigned char RXINS2      : 1;
  unsigned char RXINS3      : 1;
  unsigned char RXINS4      : 1;
  unsigned char RXINS5      : 1;
  unsigned char RXINS6      : 1;
  unsigned char RXINS7      : 1;
} __BITS_PXS_RXINSRL;
#endif
__IO_REG8_BIT(PXS_RXINSRL, 0x5313, __READ_WRITE, __BITS_PXS_RXINSRL);

/* ProxSense transmit enable register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TXEN8       : 1;
  unsigned char TXEN9       : 1;
  unsigned char TXEN10      : 1;
  unsigned char TXEN11      : 1;
  unsigned char TXEN12      : 1;
  unsigned char TXEN13      : 1;
  unsigned char TXEN14      : 1;
  unsigned char TXEN15      : 1;
} __BITS_PXS_TXENRH;
#endif
__IO_REG8_BIT(PXS_TXENRH,  0x5316, __READ_WRITE, __BITS_PXS_TXENRH);

/* ProxSense transmit enable register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TXEN0       : 1;
  unsigned char TXEN1       : 1;
  unsigned char TXEN2       : 1;
  unsigned char TXEN3       : 1;
  unsigned char TXEN4       : 1;
  unsigned char TXEN5       : 1;
  unsigned char TXEN6       : 1;
  unsigned char TXEN7       : 1;
} __BITS_PXS_TXENRL;
#endif
__IO_REG8_BIT(PXS_TXENRL,  0x5317, __READ_WRITE, __BITS_PXS_TXENRL);

/* ProxSense maximum counter value register high */
__IO_REG8    (PXS_MAXRH,   0x531A, __READ_WRITE);
/* ProxSense maximum counter value register low */
__IO_REG8    (PXS_MAXRL,   0x531B, __READ_WRITE);
/* ProxSense maximum counter enable register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char MAXEN8      : 1;
  unsigned char MAXEN9      : 1;
} __BITS_PXS_MAXENRH;
#endif
__IO_REG8_BIT(PXS_MAXENRH, 0x531C, __READ_WRITE, __BITS_PXS_MAXENRH);

/* ProxSense maximum counter enable register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char MAXEN0      : 1;
  unsigned char MAXEN1      : 1;
  unsigned char MAXEN2      : 1;
  unsigned char MAXEN3      : 1;
  unsigned char MAXEN4      : 1;
  unsigned char MAXEN5      : 1;
  unsigned char MAXEN6      : 1;
  unsigned char MAXEN7      : 1;
} __BITS_PXS_MAXENRL;
#endif
__IO_REG8_BIT(PXS_MAXENRL, 0x531D, __READ_WRITE, __BITS_PXS_MAXENRL);

/* ProxSense receiver status register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VALID8      : 1;
  unsigned char VALID9      : 1;
} __BITS_PXS_RXSRH;
#endif
__IO_REG8_BIT(PXS_RXSRH,   0x531E, __READ, __BITS_PXS_RXSRH);

/* ProxSense receiver status register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VALID0      : 1;
  unsigned char VALID1      : 1;
  unsigned char VALID2      : 1;
  unsigned char VALID3      : 1;
  unsigned char VALID4      : 1;
  unsigned char VALID5      : 1;
  unsigned char VALID6      : 1;
  unsigned char VALID7      : 1;
} __BITS_PXS_RXSRL;
#endif
__IO_REG8_BIT(PXS_RXSRL,   0x531F, __READ, __BITS_PXS_RXSRL);

/* ProxSense counter register receiver channel high */
__IO_REG8    (PXS_RX0CNTRH, 0x5320, __READ_WRITE);
/* ProxSense counter register receiver channel low */
__IO_REG8    (PXS_RX0CNTRL, 0x5321, __READ_WRITE);
/* ProxSense counter register receiver channel high */
__IO_REG8    (PXS_RX1CNTRH, 0x5322, __READ_WRITE);
/* ProxSense counter register receiver channel low */
__IO_REG8    (PXS_RX1CNTRL, 0x5323, __READ_WRITE);
/* ProxSense counter register receiver channel high */
__IO_REG8    (PXS_RX2CNTRH, 0x5324, __READ_WRITE);
/* ProxSense counter register receiver channel low */
__IO_REG8    (PXS_RX2CNTRL, 0x5325, __READ_WRITE);
/* ProxSense counter register receiver channel high */
__IO_REG8    (PXS_RX3CNTRH, 0x5326, __READ_WRITE);
/* ProxSense counter register receiver channel low */
__IO_REG8    (PXS_RX3CNTRL, 0x5327, __READ_WRITE);
/* ProxSense counter register receiver channel high */
__IO_REG8    (PXS_RX4CNTRH, 0x5328, __READ_WRITE);
/* ProxSense counter register receiver channel low */
__IO_REG8    (PXS_RX4CNTRL, 0x5329, __READ_WRITE);
/* ProxSense counter register receiver channel high */
__IO_REG8    (PXS_RX5CNTRH, 0x532A, __READ_WRITE);
/* ProxSense counter register receiver channel low */
__IO_REG8    (PXS_RX5CNTRL, 0x532B, __READ_WRITE);
/* ProxSense counter register receiver channel high */
__IO_REG8    (PXS_RX6CNTRH, 0x532C, __READ_WRITE);
/* ProxSense counter register receiver channel low */
__IO_REG8    (PXS_RX6CNTRL, 0x532D, __READ_WRITE);
/* ProxSense counter register receiver channel high */
__IO_REG8    (PXS_RX7CNTRH, 0x532E, __READ_WRITE);
/* ProxSense counter register receiver channel low */
__IO_REG8    (PXS_RX7CNTRL, 0x532F, __READ_WRITE);
/* ProxSense counter register receiver channel high */
__IO_REG8    (PXS_RX8CNTRH, 0x5330, __READ_WRITE);
/* ProxSense counter register receiver channel low */
__IO_REG8    (PXS_RX8CNTRL, 0x5331, __READ_WRITE);
/* ProxSense counter register receiver channel high */
__IO_REG8    (PXS_RX9CNTRH, 0x5332, __READ_WRITE);
/* ProxSense counter register receiver channel low */
__IO_REG8    (PXS_RX9CNTRL, 0x5333, __READ_WRITE);
/* ProxSense receiver sampling capacitor selection register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RX0CSSEL    : 5;
} __BITS_PXS_RX0CSSELR;
#endif
__IO_REG8_BIT(PXS_RX0CSSELR, 0x5340, __READ_WRITE, __BITS_PXS_RX0CSSELR);

